In [1]:
import pandas as pd
# import = 패키지를 불러온다.
# 패키지 = pandas라는 폴더

In [2]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002, 2003],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [3]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [9]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop'], index=['one', 'two', 'three', 'four', 'five', 'six'])
df

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [11]:
df.columns

Index(['year', 'state', 'pop'], dtype='object')

In [13]:
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [15]:
df.loc[['one', 'two']]

     year state  pop
one  2000  Ohio  1.5
two  2001  Ohio  1.7

In [17]:
df['name'] = 'leekeun'
df

       year   state  pop     name
one    2000    Ohio  1.5  leekeun
two    2001    Ohio  1.7  leekeun
three  2002    Ohio  3.6  leekeun
four   2001  Nevada  2.4  leekeun
five   2002  Nevada  2.9  leekeun
six    2003  Nevada  3.2  leekeun

In [18]:
df['tf'] = df.state == 'Ohio'
df

       year   state  pop     name     tf
one    2000    Ohio  1.5  leekeun   True
two    2001    Ohio  1.7  leekeun   True
three  2002    Ohio  3.6  leekeun   True
four   2001  Nevada  2.4  leekeun  False
five   2002  Nevada  2.9  leekeun  False
six    2003  Nevada  3.2  leekeun  False

In [24]:
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

In [25]:
df = pd.DataFrame(pop)

In [26]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [27]:
df.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5